<a href="https://colab.research.google.com/github/DhruvArora96/TitanicML/blob/master/main.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

url = "https://raw.githubusercontent.com/DhruvArora96/TitanicML/master/test.csv"
test_df = pd.read_csv(url)
url  ="https://raw.githubusercontent.com/DhruvArora96/TitanicML/master/train.csv"
train_df = pd.read_csv(url)

In [33]:
train_df.pop("Name")
train_df.pop("Ticket")
train_df.pop("Cabin")

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [0]:
train_df=train_df.replace({"male":0,"female":1})

In [0]:
train_df=train_df.replace({"S":0,"C":1,"Q":2})

In [0]:
train_df=train_df.dropna()

In [0]:
sv=train_df.pop("Survived")

In [0]:
train_df["Survived"]=sv

In [0]:
features=list(train_df.columns[1:8])
features
X=train_df[features]
Y=train_df["Survived"]

In [40]:
from sklearn import tree
clf = tree.DecisionTreeClassifier()
clf.fit(X, Y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [41]:
test_df.pop("Name")
test_df.pop("Ticket")
test_df.pop("Cabin")

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
413     NaN
414    C105
415     NaN
416     NaN
417     NaN
Name: Cabin, Length: 418, dtype: object

In [42]:
test_df.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0          892       3    male  34.5      0      0   7.8292        Q
1          893       3  female  47.0      1      0   7.0000        S
2          894       2    male  62.0      0      0   9.6875        Q
3          895       3    male  27.0      0      0   8.6625        S
4          896       3  female  22.0      1      1  12.2875        S

In [0]:
test_df=test_df.replace({"male":0,"female":1})
test_df=test_df.replace({"S":0,"C":1,"Q":2})
test_df=test_df.dropna()

In [0]:
test_out=clf.predict(test_df[features])

In [52]:
out_file=pd.DataFrame()
out_file["PassengerId"]=test_df["PassengerId"]
out_file["Survived"]=test_out
out_file

     PassengerId  Survived
0            892         0
1            893         0
2            894         1
3            895         1
4            896         0
..           ...       ...
409         1301         1
411         1303         1
412         1304         0
414         1306         1
415         1307         0

[331 rows x 2 columns]